{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import necessary libraries and configuration of database\n",
    "import pandas as pd\n",
    "from sqlalchemy import create_engine # For creating a database connection\n",
    "from neo4j import GraphDatabase \n",
    "\n",
    "import const as c # Import database URL host, userid and password"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create a PostgreSQL database engine\n",
    "engine = create_engine(\n",
    "    f'postgresql://{c.pg_userid}:{c.pg_password}@{c.pg_host}/{c.pg_db}', \n",
    "    connect_args = {'options': '-c search_path=uadbkt,umobility,public', 'keepalives_idle': 120},\n",
    "    pool_size=1, \n",
    "    max_overflow=0,\n",
    "    execution_options={ 'isolation_level': 'AUTOCOMMIT' }\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 1. Create graph-based data in Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import table \"haltestelle\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>hid</th>\n",
       "      <th>bez</th>\n",
       "      <th>lat</th>\n",
       "      <th>lng</th>\n",
       "      <th>pos</th>\n",
       "      <th>posp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10001</td>\n",
       "      <td>TheodorHeussPlatz</td>\n",
       "      <td>52.509798</td>\n",
       "      <td>13.272977</td>\n",
       "      <td>0101000020E6100000D11E2FA4C38B2A407AC8940F4141...</td>\n",
       "      <td>0101000020EC7A000058D203B2087F514187C6D6C0F933...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>10145</td>\n",
       "      <td>Alexanderplatz</td>\n",
       "      <td>52.521512</td>\n",
       "      <td>13.411267</td>\n",
       "      <td>0101000020E61000001BD9959691D22A405C3CBCE7C042...</td>\n",
       "      <td>0101000020EC7A000027AF1D782D8851414CD43F416B35...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>10146</td>\n",
       "      <td>BerlinHauptbahnhof</td>\n",
       "      <td>52.525847</td>\n",
       "      <td>13.368924</td>\n",
       "      <td>0101000020E6100000446B459BE3BC2A4090D959F44E43...</td>\n",
       "      <td>0101000020EC7A00007F1AF7B35C855141C9C84100D635...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>10147</td>\n",
       "      <td>BrandenburgerTor</td>\n",
       "      <td>52.516511</td>\n",
       "      <td>13.381937</td>\n",
       "      <td>0101000020E6100000C443183F8DC32A401B834E081D42...</td>\n",
       "      <td>0101000020EC7A0000897EF6753E8651414713C781D634...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>10148</td>\n",
       "      <td>Bundesplatz</td>\n",
       "      <td>52.477366</td>\n",
       "      <td>13.329149</td>\n",
       "      <td>0101000020E6100000AF05BD3786A82A40761C3F541A3D...</td>\n",
       "      <td>0101000020EC7A000086320CB3D2825141698308C58430...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>168</th>\n",
       "      <td>10319</td>\n",
       "      <td>WilmersdorferStr</td>\n",
       "      <td>52.506415</td>\n",
       "      <td>13.306774</td>\n",
       "      <td>0101000020E6100000B686527B119D2A40179AEB34D240...</td>\n",
       "      <td>0101000020EC7A0000F05A9E064881514199FDECE5A533...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>169</th>\n",
       "      <td>10320</td>\n",
       "      <td>Wittenbergplatz</td>\n",
       "      <td>52.502109</td>\n",
       "      <td>13.342561</td>\n",
       "      <td>0101000020E610000026C5C72764AF2A407D03931B4540...</td>\n",
       "      <td>0101000020EC7A0000CD5C88B3A9835141F30DDF433933...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>170</th>\n",
       "      <td>10321</td>\n",
       "      <td>Wutzkyallee</td>\n",
       "      <td>52.423152</td>\n",
       "      <td>13.474820</td>\n",
       "      <td>0101000020E610000033F9669B1BF32A40569E40D82936...</td>\n",
       "      <td>0101000020EC7A0000342364B99B8C51411457CAC4D02A...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>171</th>\n",
       "      <td>10322</td>\n",
       "      <td>Zitadelle</td>\n",
       "      <td>52.537522</td>\n",
       "      <td>13.217625</td>\n",
       "      <td>0101000020E61000008195438B6C6F2A40B5705985CD44...</td>\n",
       "      <td>0101000020EC7A000031323734507B51410E7A9AC3EC36...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>172</th>\n",
       "      <td>10323</td>\n",
       "      <td>ZwickauerDamm</td>\n",
       "      <td>52.423032</td>\n",
       "      <td>13.484371</td>\n",
       "      <td>0101000020E6100000FA42C879FFF72A40AB949EE92536...</td>\n",
       "      <td>0101000020EC7A00001A9EF5363E8D5141B2C3CBC1D02A...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>173 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       hid                 bez        lat        lng  \\\n",
       "0    10001   TheodorHeussPlatz  52.509798  13.272977   \n",
       "1    10145      Alexanderplatz  52.521512  13.411267   \n",
       "2    10146  BerlinHauptbahnhof  52.525847  13.368924   \n",
       "3    10147    BrandenburgerTor  52.516511  13.381937   \n",
       "4    10148         Bundesplatz  52.477366  13.329149   \n",
       "..     ...                 ...        ...        ...   \n",
       "168  10319    WilmersdorferStr  52.506415  13.306774   \n",
       "169  10320     Wittenbergplatz  52.502109  13.342561   \n",
       "170  10321         Wutzkyallee  52.423152  13.474820   \n",
       "171  10322           Zitadelle  52.537522  13.217625   \n",
       "172  10323       ZwickauerDamm  52.423032  13.484371   \n",
       "\n",
       "                                                   pos  \\\n",
       "0    0101000020E6100000D11E2FA4C38B2A407AC8940F4141...   \n",
       "1    0101000020E61000001BD9959691D22A405C3CBCE7C042...   \n",
       "2    0101000020E6100000446B459BE3BC2A4090D959F44E43...   \n",
       "3    0101000020E6100000C443183F8DC32A401B834E081D42...   \n",
       "4    0101000020E6100000AF05BD3786A82A40761C3F541A3D...   \n",
       "..                                                 ...   \n",
       "168  0101000020E6100000B686527B119D2A40179AEB34D240...   \n",
       "169  0101000020E610000026C5C72764AF2A407D03931B4540...   \n",
       "170  0101000020E610000033F9669B1BF32A40569E40D82936...   \n",
       "171  0101000020E61000008195438B6C6F2A40B5705985CD44...   \n",
       "172  0101000020E6100000FA42C879FFF72A40AB949EE92536...   \n",
       "\n",
       "                                                  posp  \n",
       "0    0101000020EC7A000058D203B2087F514187C6D6C0F933...  \n",
       "1    0101000020EC7A000027AF1D782D8851414CD43F416B35...  \n",
       "2    0101000020EC7A00007F1AF7B35C855141C9C84100D635...  \n",
       "3    0101000020EC7A0000897EF6753E8651414713C781D634...  \n",
       "4    0101000020EC7A000086320CB3D2825141698308C58430...  \n",
       "..                                                 ...  \n",
       "168  0101000020EC7A0000F05A9E064881514199FDECE5A533...  \n",
       "169  0101000020EC7A0000CD5C88B3A9835141F30DDF433933...  \n",
       "170  0101000020EC7A0000342364B99B8C51411457CAC4D02A...  \n",
       "171  0101000020EC7A000031323734507B51410E7A9AC3EC36...  \n",
       "172  0101000020EC7A00001A9EF5363E8D5141B2C3CBC1D02A...  \n",
       "\n",
       "[173 rows x 6 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Execute SQL query to retrieve data from the 'haltestelle' table in Postgres\n",
    "with engine.connect() as con:\n",
    "    sql = \"select * from haltestelle\"\n",
    "    haltestellen_df = pd.read_sql_query(sql, con)\n",
    "    \n",
    "haltestellen_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Neo4j nodes for stations with property constraints\n",
    "cypher_create_stop = 'CREATE (h:Haltestelle {hid: $hid, bez: $bez, lat:$lat, lng:$lng})'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        for r in haltestellen_df.itertuples(index=False):\n",
    "            session.run(cypher_create_stop, hid=r.hid, bez=r.bez, lat=r.lat, lng=r.lng)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import table \"abschnitt\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ulid</th>\n",
       "      <th>nr</th>\n",
       "      <th>hid_a</th>\n",
       "      <th>hid_b</th>\n",
       "      <th>haelt</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1017001</td>\n",
       "      <td>1</td>\n",
       "      <td>10170</td>\n",
       "      <td>10295</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1017001</td>\n",
       "      <td>2</td>\n",
       "      <td>10295</td>\n",
       "      <td>10219</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1017001</td>\n",
       "      <td>3</td>\n",
       "      <td>10219</td>\n",
       "      <td>10243</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1017001</td>\n",
       "      <td>4</td>\n",
       "      <td>10243</td>\n",
       "      <td>10278</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1017001</td>\n",
       "      <td>5</td>\n",
       "      <td>10278</td>\n",
       "      <td>10222</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>565</th>\n",
       "      <td>1026004</td>\n",
       "      <td>8</td>\n",
       "      <td>10223</td>\n",
       "      <td>10179</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>566</th>\n",
       "      <td>1026004</td>\n",
       "      <td>9</td>\n",
       "      <td>10179</td>\n",
       "      <td>10245</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>567</th>\n",
       "      <td>1026004</td>\n",
       "      <td>10</td>\n",
       "      <td>10245</td>\n",
       "      <td>10303</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>568</th>\n",
       "      <td>1026004</td>\n",
       "      <td>11</td>\n",
       "      <td>10303</td>\n",
       "      <td>10220</td>\n",
       "      <td>-</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>569</th>\n",
       "      <td>1026004</td>\n",
       "      <td>12</td>\n",
       "      <td>10220</td>\n",
       "      <td>10189</td>\n",
       "      <td>+</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>570 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        ulid  nr  hid_a  hid_b haelt\n",
       "0    1017001   1  10170  10295     +\n",
       "1    1017001   2  10295  10219     +\n",
       "2    1017001   3  10219  10243     +\n",
       "3    1017001   4  10243  10278     +\n",
       "4    1017001   5  10278  10222     +\n",
       "..       ...  ..    ...    ...   ...\n",
       "565  1026004   8  10223  10179     +\n",
       "566  1026004   9  10179  10245     +\n",
       "567  1026004  10  10245  10303     +\n",
       "568  1026004  11  10303  10220     -\n",
       "569  1026004  12  10220  10189     +\n",
       "\n",
       "[570 rows x 5 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Execute SQL query to retrieve data from the 'abschnitt' table in Postgres\n",
    "with engine.connect() as con:\n",
    "    sql = \"select * from abschnitt\"\n",
    "    abschnitt_df = pd.read_sql_query(sql, con)\n",
    "    \n",
    "abschnitt_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Neo4j nodes for sections with property constraints\n",
    "cypher_create_stop = 'CREATE (a:Abschnitt {ulid: $ulid, nr: $nr, hid_a:$hid_a, hid_b:$hid_b, haelt:$haelt})'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        for r in abschnitt_df.itertuples(index=False):\n",
    "            session.run(cypher_create_stop, ulid=r.ulid, nr=r.nr, hid_a=r.hid_a, hid_b=r.hid_b, haelt=r.haelt)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import table \"linie\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>lid</th>\n",
       "      <th>bez</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1017</td>\n",
       "      <td>U1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1018</td>\n",
       "      <td>U2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1019</td>\n",
       "      <td>U3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1020</td>\n",
       "      <td>U4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1021</td>\n",
       "      <td>U5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1022</td>\n",
       "      <td>U55</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1023</td>\n",
       "      <td>U6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1024</td>\n",
       "      <td>U7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1025</td>\n",
       "      <td>U8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>1026</td>\n",
       "      <td>U9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    lid  bez\n",
       "0  1017   U1\n",
       "1  1018   U2\n",
       "2  1019   U3\n",
       "3  1020   U4\n",
       "4  1021   U5\n",
       "5  1022  U55\n",
       "6  1023   U6\n",
       "7  1024   U7\n",
       "8  1025   U8\n",
       "9  1026   U9"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Execute SQL query to retrieve data from the 'linie' table in Postgres\n",
    "with engine.connect() as con:\n",
    "    sql = \"select * from linie\"\n",
    "    linie_df = pd.read_sql_query(sql, con)\n",
    "    \n",
    "linie_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Neo4j nodes for lines with property constraints\n",
    "cypher_create_stop = 'CREATE (l:Linie {lid: $lid, bez: $bez})'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        for r in linie_df.itertuples(index=False):\n",
    "            session.run(cypher_create_stop, lid=r.lid, bez=r.bez)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import table \"unterlinie\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ulid</th>\n",
       "      <th>lid</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1017001</td>\n",
       "      <td>1017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1017003</td>\n",
       "      <td>1017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1018001</td>\n",
       "      <td>1018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1018003</td>\n",
       "      <td>1018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1019001</td>\n",
       "      <td>1019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1019003</td>\n",
       "      <td>1019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1020001</td>\n",
       "      <td>1020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1020003</td>\n",
       "      <td>1020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1021001</td>\n",
       "      <td>1021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>1021003</td>\n",
       "      <td>1021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>1022001</td>\n",
       "      <td>1022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>1022003</td>\n",
       "      <td>1022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>1023001</td>\n",
       "      <td>1023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>1023003</td>\n",
       "      <td>1023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>1024001</td>\n",
       "      <td>1024</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>1024003</td>\n",
       "      <td>1024</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>1025001</td>\n",
       "      <td>1025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>1025003</td>\n",
       "      <td>1025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>1026001</td>\n",
       "      <td>1026</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>1026003</td>\n",
       "      <td>1026</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>1017002</td>\n",
       "      <td>1017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>1017004</td>\n",
       "      <td>1017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>1018002</td>\n",
       "      <td>1018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>1018004</td>\n",
       "      <td>1018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>1019002</td>\n",
       "      <td>1019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>1019004</td>\n",
       "      <td>1019</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>1020002</td>\n",
       "      <td>1020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>1020004</td>\n",
       "      <td>1020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>1021002</td>\n",
       "      <td>1021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>1021004</td>\n",
       "      <td>1021</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>1022002</td>\n",
       "      <td>1022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>1022004</td>\n",
       "      <td>1022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>1023002</td>\n",
       "      <td>1023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>1023004</td>\n",
       "      <td>1023</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>1024002</td>\n",
       "      <td>1024</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>1024004</td>\n",
       "      <td>1024</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>1025002</td>\n",
       "      <td>1025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>1025004</td>\n",
       "      <td>1025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>1026002</td>\n",
       "      <td>1026</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>1026004</td>\n",
       "      <td>1026</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       ulid   lid\n",
       "0   1017001  1017\n",
       "1   1017003  1017\n",
       "2   1018001  1018\n",
       "3   1018003  1018\n",
       "4   1019001  1019\n",
       "5   1019003  1019\n",
       "6   1020001  1020\n",
       "7   1020003  1020\n",
       "8   1021001  1021\n",
       "9   1021003  1021\n",
       "10  1022001  1022\n",
       "11  1022003  1022\n",
       "12  1023001  1023\n",
       "13  1023003  1023\n",
       "14  1024001  1024\n",
       "15  1024003  1024\n",
       "16  1025001  1025\n",
       "17  1025003  1025\n",
       "18  1026001  1026\n",
       "19  1026003  1026\n",
       "20  1017002  1017\n",
       "21  1017004  1017\n",
       "22  1018002  1018\n",
       "23  1018004  1018\n",
       "24  1019002  1019\n",
       "25  1019004  1019\n",
       "26  1020002  1020\n",
       "27  1020004  1020\n",
       "28  1021002  1021\n",
       "29  1021004  1021\n",
       "30  1022002  1022\n",
       "31  1022004  1022\n",
       "32  1023002  1023\n",
       "33  1023004  1023\n",
       "34  1024002  1024\n",
       "35  1024004  1024\n",
       "36  1025002  1025\n",
       "37  1025004  1025\n",
       "38  1026002  1026\n",
       "39  1026004  1026"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Execute SQL query to retrieve data from the 'unterlinie' table in Postgres\n",
    "with engine.connect() as con:\n",
    "    sql = \"select * from unterlinie\"\n",
    "    unterlinie_df = pd.read_sql_query(sql, con)\n",
    "    \n",
    "unterlinie_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Neo4j nodes for sublines with property constraints\n",
    "cypher_create_stop = 'CREATE (ul:Unterlinie {ulid: $ulid, lid: $lid})'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        for r in unterlinie_df.itertuples(index=False):\n",
    "            session.run(cypher_create_stop, ulid=r.ulid, lid=r.lid)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Import table \"segment\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>hid_a</th>\n",
       "      <th>hid_b</th>\n",
       "      <th>laenge_in_meter</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10001</td>\n",
       "      <td>10263</td>\n",
       "      <td>1152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>10145</td>\n",
       "      <td>10240</td>\n",
       "      <td>483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>10145</td>\n",
       "      <td>10294</td>\n",
       "      <td>734</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>10145</td>\n",
       "      <td>10317</td>\n",
       "      <td>590</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>10146</td>\n",
       "      <td>10200</td>\n",
       "      <td>694</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>179</th>\n",
       "      <td>10320</td>\n",
       "      <td>10187</td>\n",
       "      <td>429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>180</th>\n",
       "      <td>10320</td>\n",
       "      <td>10245</td>\n",
       "      <td>779</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>181</th>\n",
       "      <td>10321</td>\n",
       "      <td>10251</td>\n",
       "      <td>814</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>182</th>\n",
       "      <td>10322</td>\n",
       "      <td>10185</td>\n",
       "      <td>759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>183</th>\n",
       "      <td>10323</td>\n",
       "      <td>10321</td>\n",
       "      <td>650</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>184 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     hid_a  hid_b  laenge_in_meter\n",
       "0    10001  10263             1152\n",
       "1    10145  10240              483\n",
       "2    10145  10294              734\n",
       "3    10145  10317              590\n",
       "4    10146  10200              694\n",
       "..     ...    ...              ...\n",
       "179  10320  10187              429\n",
       "180  10320  10245              779\n",
       "181  10321  10251              814\n",
       "182  10322  10185              759\n",
       "183  10323  10321              650\n",
       "\n",
       "[184 rows x 3 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Execute SQL query to retrieve data from the 'segment' table in Postgres\n",
    "with engine.connect() as con:\n",
    "    sql = \"select * from segment\"\n",
    "    segment_df = pd.read_sql_query(sql, con)\n",
    "    \n",
    "segment_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Neo4j nodes for segments with property constraints\n",
    "cypher_create_stop = 'CREATE (s:Segment {hid_a: $hid_a, hid_b: $hid_b, laenge_in_meter: $laenge_in_meter})'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        for r in segment_df.itertuples(index=False):\n",
    "            session.run(cypher_create_stop, hid_a=r.hid_a, hid_b=r.hid_b, laenge_in_meter=r.laenge_in_meter)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 2. Create relationships between nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_create_stop = 'MATCH (a:Abschnitt), (h:Haltestelle) WHERE h.hid = a.hid_a CREATE (a)-[:ProjAbA]->(h)'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            session.run(cypher_create_stop)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_create_stop = 'MATCH (a:Abschnitt), (h:Haltestelle) WHERE h.hid = a.hid_b CREATE (a)-[:ProjAbB]->(h)'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            session.run(cypher_create_stop)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_create_stop = 'MATCH (s:Segment), (h:Haltestelle) WHERE h.hid = s.hid_a CREATE (s)-[:ProjSegA]->(h)'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            session.run(cypher_create_stop)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_create_stop = 'MATCH (s:Segment), (h:Haltestelle) WHERE h.hid = s.hid_b CREATE (s)-[:ProjSegB]->(h)'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            session.run(cypher_create_stop)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_create_stop = 'MATCH (a:Abschnitt), (ul:Unterlinie) WHERE a.ulid = ul.ulid CREATE (a)-[:InUL]->(ul)'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            session.run(cypher_create_stop)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_create_stop = 'MATCH (ul:Unterlinie), (l:Linie) WHERE ul.lid = l.lid CREATE (ul)-[:InL]->(l)'\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            session.run(cypher_create_stop)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_create_stop = \"\"\"\n",
    "MATCH (h1:Haltestelle{hid:$hid_a}), (h2:Haltestelle{hid:$hid_b})\n",
    "CREATE (h1)-[:Verbindet{laenge_in_meter:$laenge_in_meter}]->(h2), \n",
    " (h2)-[:Verbindet{laenge_in_meter:$laenge_in_meter}]->(h1)\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        for r in segment_df.itertuples(index=False):\n",
    "            session.run(cypher_create_stop, hid_a=r.hid_a, hid_b=r.hid_b, laenge_in_meter=r.laenge_in_meter)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 1: Lines per sections"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Start</th>\n",
       "      <th>Ende</th>\n",
       "      <th>Linien</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Adenauerplatz</td>\n",
       "      <td>WilmersdorferStr</td>\n",
       "      <td>[U7]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Adenauerplatz</td>\n",
       "      <td>KonstanzerStr</td>\n",
       "      <td>[U7]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>AfrikanischeStr</td>\n",
       "      <td>KurtSchumacherPlatz</td>\n",
       "      <td>[U6]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>AfrikanischeStr</td>\n",
       "      <td>Rehberge</td>\n",
       "      <td>[U6]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Alexanderplatz</td>\n",
       "      <td>RosaLuxemburgPlatz</td>\n",
       "      <td>[U2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>363</th>\n",
       "      <td>ZoologischerGarten</td>\n",
       "      <td>ErnstReuterPlatz</td>\n",
       "      <td>[U2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>364</th>\n",
       "      <td>ZoologischerGarten</td>\n",
       "      <td>Hansaplatz</td>\n",
       "      <td>[U9]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>365</th>\n",
       "      <td>ZoologischerGarten</td>\n",
       "      <td>Kurfürstendamm</td>\n",
       "      <td>[U9]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>366</th>\n",
       "      <td>ZwickauerDamm</td>\n",
       "      <td>Wutzkyallee</td>\n",
       "      <td>[U7]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>367</th>\n",
       "      <td>ZwickauerDamm</td>\n",
       "      <td>Rudow</td>\n",
       "      <td>[U7]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>368 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                  Start                 Ende Linien\n",
       "0         Adenauerplatz     WilmersdorferStr   [U7]\n",
       "1         Adenauerplatz        KonstanzerStr   [U7]\n",
       "2       AfrikanischeStr  KurtSchumacherPlatz   [U6]\n",
       "3       AfrikanischeStr             Rehberge   [U6]\n",
       "4        Alexanderplatz   RosaLuxemburgPlatz   [U2]\n",
       "..                  ...                  ...    ...\n",
       "363  ZoologischerGarten     ErnstReuterPlatz   [U2]\n",
       "364  ZoologischerGarten           Hansaplatz   [U9]\n",
       "365  ZoologischerGarten       Kurfürstendamm   [U9]\n",
       "366       ZwickauerDamm          Wutzkyallee   [U7]\n",
       "367       ZwickauerDamm                Rudow   [U7]\n",
       "\n",
       "[368 rows x 3 columns]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4j = \"\"\"\n",
    "match (h1:Haltestelle)<-[:ProjAbA]-(a:Abschnitt), (h2:Haltestelle)<-[:ProjAbB]-(a:Abschnitt), (a:Abschnitt)-[:InUL]->(u:Unterlinie)-[:InL]->(l:Linie)\n",
    "return h1.bez as Start, h2.bez as Ende, collect(distinct l.bez) as Linien\n",
    "order by Start\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            result = session.run(neo4j)\n",
    "            a1_df = pd.DataFrame(result.data())\n",
    "            \n",
    "a1_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 2:  Subline routes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Linie</th>\n",
       "      <th>Unterlinie</th>\n",
       "      <th>Verlauf</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>U1</td>\n",
       "      <td>1017001</td>\n",
       "      <td>[+WarschauerStr, +SchlesischesTor, +GörlitzerB...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>U1</td>\n",
       "      <td>1017002</td>\n",
       "      <td>[+UhlandStr, +Kurfürstendamm, +Wittenbergplatz...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>U1</td>\n",
       "      <td>1017003</td>\n",
       "      <td>[+KottbusserTor, -PrinzenStr, +HalleschesTor, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>U1</td>\n",
       "      <td>1017004</td>\n",
       "      <td>[+Kurfürstendamm, +Wittenbergplatz, +Nollendor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>U2</td>\n",
       "      <td>1018001</td>\n",
       "      <td>[+Pankow, +VinetaStr, +SchönhauserAllee, +Eber...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>U2</td>\n",
       "      <td>1018002</td>\n",
       "      <td>[+Ruhleben, +OlympiaStadion, +NeuWestend, +The...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>U2</td>\n",
       "      <td>1018003</td>\n",
       "      <td>[+Alexanderplatz, -KlosterStr, -MärkischesMuse...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>U2</td>\n",
       "      <td>1018004</td>\n",
       "      <td>[+BismarckStr, +DeutscheOper, +ErnstReuterPlat...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>U3</td>\n",
       "      <td>1019001</td>\n",
       "      <td>[+WarschauerStr, +SchlesischesTor, +GörlitzerB...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>U3</td>\n",
       "      <td>1019002</td>\n",
       "      <td>[+KrummeLanke, +OnkelTomsHütte, +OskarHeleneHe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>U3</td>\n",
       "      <td>1019003</td>\n",
       "      <td>[+WarschauerStr, -SchlesischesTor, -GörlitzerB...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>U3</td>\n",
       "      <td>1019004</td>\n",
       "      <td>[+Möckernbrücke, +HalleschesTor, +PrinzenStr, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>U4</td>\n",
       "      <td>1020001</td>\n",
       "      <td>[+InnsbruckerPlatz, +RathausSchöneberg, +Bayer...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>U4</td>\n",
       "      <td>1020002</td>\n",
       "      <td>[+Nollendorfplatz, +ViktoriaLuisePlatz, +Bayer...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>U4</td>\n",
       "      <td>1020003</td>\n",
       "      <td>[+BayerischerPlatz, +ViktoriaLuisePlatz, +Noll...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>U4</td>\n",
       "      <td>1020004</td>\n",
       "      <td>[+Nollendorfplatz, +ViktoriaLuisePlatz, +Bayer...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>U5</td>\n",
       "      <td>1021001</td>\n",
       "      <td>[+Alexanderplatz, +SchillingStr, +Strausberger...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>U5</td>\n",
       "      <td>1021002</td>\n",
       "      <td>[+Hönow, +LouisLewinStr, +Hellersdorf, +Cottbu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>U5</td>\n",
       "      <td>1021003</td>\n",
       "      <td>[+Alexanderplatz, +SchillingStr, -Strausberger...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>U5</td>\n",
       "      <td>1021004</td>\n",
       "      <td>[+FrankfurterAllee, +SamariterStr, -Frankfurte...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>U55</td>\n",
       "      <td>1022001</td>\n",
       "      <td>[+BerlinHauptbahnhof, +Bundestag, +Brandenburg...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>U55</td>\n",
       "      <td>1022002</td>\n",
       "      <td>[+BrandenburgerTor, +Bundestag, +BerlinHauptba...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>U55</td>\n",
       "      <td>1022003</td>\n",
       "      <td>[+BerlinHauptbahnhof, +Bundestag]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>U55</td>\n",
       "      <td>1022004</td>\n",
       "      <td>[+Bundestag, +BerlinHauptbahnhof]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>U6</td>\n",
       "      <td>1023001</td>\n",
       "      <td>[+AltMariendorf, +Westphalweg, +UllsteinStr, +...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>U6</td>\n",
       "      <td>1023002</td>\n",
       "      <td>[+AltTegel, +Borsigwerke, +HolzhauserStr, +Oti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>U6</td>\n",
       "      <td>1023003</td>\n",
       "      <td>[+Mehringdamm, +HalleschesTor, +KochStr, +Stad...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>U6</td>\n",
       "      <td>1023004</td>\n",
       "      <td>[+Leopoldplatz, -Wedding, -ReinickendorferStr,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>U7</td>\n",
       "      <td>1024001</td>\n",
       "      <td>[+Rudow, +ZwickauerDamm, +Wutzkyallee, +Lipsch...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>U7</td>\n",
       "      <td>1024002</td>\n",
       "      <td>[+RathausSpandau, +AltstadtSpandau, +Zitadelle...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>U7</td>\n",
       "      <td>1024003</td>\n",
       "      <td>[+Hermannplatz, +Südstern, +Gneisenaustr, +Meh...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>U7</td>\n",
       "      <td>1024004</td>\n",
       "      <td>[+BismarckStr, -WilmersdorferStr, -Adenauerpla...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>U8</td>\n",
       "      <td>1025001</td>\n",
       "      <td>[+HermannStr, +LeineStr, +BoddinStr, +Hermannp...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>U8</td>\n",
       "      <td>1025002</td>\n",
       "      <td>[+Wittenau, +RathausReinickendorf, +KarlBonhoe...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>U8</td>\n",
       "      <td>1025003</td>\n",
       "      <td>[+Hermannplatz, +SchönleinStr, +KottbusserTor,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>U8</td>\n",
       "      <td>1025004</td>\n",
       "      <td>[+OsloerStr, -PankStr, +Gesundbrunnen, -VoltaS...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>U9</td>\n",
       "      <td>1026001</td>\n",
       "      <td>[+RathausSteglitz, +SchloßStr, +WaltherSchreib...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>U9</td>\n",
       "      <td>1026002</td>\n",
       "      <td>[+OsloerStr, +NauenerPlatz, +Leopoldplatz, +Am...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>U9</td>\n",
       "      <td>1026003</td>\n",
       "      <td>[+BerlinerStr, -GüntzelStr, +SpichernStr, +Kur...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>U9</td>\n",
       "      <td>1026004</td>\n",
       "      <td>[+OsloerStr, +NauenerPlatz, +Leopoldplatz, +Am...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Linie  Unterlinie                                            Verlauf\n",
       "0     U1     1017001  [+WarschauerStr, +SchlesischesTor, +GörlitzerB...\n",
       "1     U1     1017002  [+UhlandStr, +Kurfürstendamm, +Wittenbergplatz...\n",
       "2     U1     1017003  [+KottbusserTor, -PrinzenStr, +HalleschesTor, ...\n",
       "3     U1     1017004  [+Kurfürstendamm, +Wittenbergplatz, +Nollendor...\n",
       "4     U2     1018001  [+Pankow, +VinetaStr, +SchönhauserAllee, +Eber...\n",
       "5     U2     1018002  [+Ruhleben, +OlympiaStadion, +NeuWestend, +The...\n",
       "6     U2     1018003  [+Alexanderplatz, -KlosterStr, -MärkischesMuse...\n",
       "7     U2     1018004  [+BismarckStr, +DeutscheOper, +ErnstReuterPlat...\n",
       "8     U3     1019001  [+WarschauerStr, +SchlesischesTor, +GörlitzerB...\n",
       "9     U3     1019002  [+KrummeLanke, +OnkelTomsHütte, +OskarHeleneHe...\n",
       "10    U3     1019003  [+WarschauerStr, -SchlesischesTor, -GörlitzerB...\n",
       "11    U3     1019004  [+Möckernbrücke, +HalleschesTor, +PrinzenStr, ...\n",
       "12    U4     1020001  [+InnsbruckerPlatz, +RathausSchöneberg, +Bayer...\n",
       "13    U4     1020002  [+Nollendorfplatz, +ViktoriaLuisePlatz, +Bayer...\n",
       "14    U4     1020003  [+BayerischerPlatz, +ViktoriaLuisePlatz, +Noll...\n",
       "15    U4     1020004  [+Nollendorfplatz, +ViktoriaLuisePlatz, +Bayer...\n",
       "16    U5     1021001  [+Alexanderplatz, +SchillingStr, +Strausberger...\n",
       "17    U5     1021002  [+Hönow, +LouisLewinStr, +Hellersdorf, +Cottbu...\n",
       "18    U5     1021003  [+Alexanderplatz, +SchillingStr, -Strausberger...\n",
       "19    U5     1021004  [+FrankfurterAllee, +SamariterStr, -Frankfurte...\n",
       "20   U55     1022001  [+BerlinHauptbahnhof, +Bundestag, +Brandenburg...\n",
       "21   U55     1022002  [+BrandenburgerTor, +Bundestag, +BerlinHauptba...\n",
       "22   U55     1022003                  [+BerlinHauptbahnhof, +Bundestag]\n",
       "23   U55     1022004                  [+Bundestag, +BerlinHauptbahnhof]\n",
       "24    U6     1023001  [+AltMariendorf, +Westphalweg, +UllsteinStr, +...\n",
       "25    U6     1023002  [+AltTegel, +Borsigwerke, +HolzhauserStr, +Oti...\n",
       "26    U6     1023003  [+Mehringdamm, +HalleschesTor, +KochStr, +Stad...\n",
       "27    U6     1023004  [+Leopoldplatz, -Wedding, -ReinickendorferStr,...\n",
       "28    U7     1024001  [+Rudow, +ZwickauerDamm, +Wutzkyallee, +Lipsch...\n",
       "29    U7     1024002  [+RathausSpandau, +AltstadtSpandau, +Zitadelle...\n",
       "30    U7     1024003  [+Hermannplatz, +Südstern, +Gneisenaustr, +Meh...\n",
       "31    U7     1024004  [+BismarckStr, -WilmersdorferStr, -Adenauerpla...\n",
       "32    U8     1025001  [+HermannStr, +LeineStr, +BoddinStr, +Hermannp...\n",
       "33    U8     1025002  [+Wittenau, +RathausReinickendorf, +KarlBonhoe...\n",
       "34    U8     1025003  [+Hermannplatz, +SchönleinStr, +KottbusserTor,...\n",
       "35    U8     1025004  [+OsloerStr, -PankStr, +Gesundbrunnen, -VoltaS...\n",
       "36    U9     1026001  [+RathausSteglitz, +SchloßStr, +WaltherSchreib...\n",
       "37    U9     1026002  [+OsloerStr, +NauenerPlatz, +Leopoldplatz, +Am...\n",
       "38    U9     1026003  [+BerlinerStr, -GüntzelStr, +SpichernStr, +Kur...\n",
       "39    U9     1026004  [+OsloerStr, +NauenerPlatz, +Leopoldplatz, +Am..."
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# A plus or minus sign is to be used to indicate whether the subline stops at the respective station or not. Assume that there is always a stop at the first and last stop of a subline.\n",
    "q = \"\"\"MATCH (ha:Haltestelle), (hb:Haltestelle), (a:Abschnitt),(u:Unterlinie),(l:Linie)\n",
    "WHERE ha.hid = a.hid_a AND hb.hid = a.hid_b AND a.ulid = u.ulid AND u.lid = l.lid\n",
    "WITH l.bez as Linie, u.ulid as Unterlinie, collect(a.haelt) as h, collect(ha.bez) as has, collect(hb.bez) as hbs\n",
    "UNWIND has+hbs AS v\n",
    "WITH Linie, Unterlinie, h, collect(distinct v) as v\n",
    "WITH Linie, Unterlinie, reverse(reverse(h)+['+']) as h, v\n",
    "RETURN Linie, Unterlinie, [x in apoc.coll.zip(h,v)|x[0]+x[1]] as Verlauf ORDER BY Linie, Unterlinie\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        result = session.run(q)\n",
    "        a2_df = pd.DataFrame(result.data())\n",
    "a2_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3. Create projected graph for executing algorithms"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeQuery</th>\n",
       "      <th>relationshipQuery</th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>relationshipCount</th>\n",
       "      <th>projectMillis</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>MATCH (h:Haltestelle) RETURN id(h) AS id</td>\n",
       "      <td>MATCH (h1:Haltestelle)&lt;-[sega:ProjSegA]-(s:Seg...</td>\n",
       "      <td>g</td>\n",
       "      <td>173</td>\n",
       "      <td>368</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  nodeQuery  \\\n",
       "0  MATCH (h:Haltestelle) RETURN id(h) AS id   \n",
       "\n",
       "                                   relationshipQuery graphName  nodeCount  \\\n",
       "0  MATCH (h1:Haltestelle)<-[sega:ProjSegA]-(s:Seg...         g        173   \n",
       "\n",
       "   relationshipCount  projectMillis  \n",
       "0                368             13  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4j = \"\"\"\n",
    "CALL gds.graph.project.cypher('g',\n",
    "'MATCH (h:Haltestelle) RETURN id(h) AS id',\n",
    "'MATCH (h1:Haltestelle)<-[sega:ProjSegA]-(s:Segment)-[segb:ProjSegB]->(h2:Haltestelle) \n",
    " RETURN id(h1) AS source, id(h2) AS target, s.laenge_in_meter AS l\n",
    " UNION\n",
    " MATCH (h1:Haltestelle)<-[segb:ProjSegB]-(s:Segment)-[sega:ProjSegA]->(h2:Haltestelle) \n",
    " RETURN id(h1) AS source, id(h2) AS target, s.laenge_in_meter AS l')\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            result = session.run(neo4j)\n",
    "            a3_df = pd.DataFrame(result.data())\n",
    "            \n",
    "a3_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 4: Compute strongly connected components of each station"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Haltestelle</th>\n",
       "      <th>Komponente</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>BerlinHauptbahnhof</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>BrandenburgerTor</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bundestag</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>TheodorHeussPlatz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Alexanderplatz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>168</th>\n",
       "      <td>WilmersdorferStr</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>169</th>\n",
       "      <td>Wittenbergplatz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>170</th>\n",
       "      <td>Wutzkyallee</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>171</th>\n",
       "      <td>Zitadelle</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>172</th>\n",
       "      <td>ZwickauerDamm</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>173 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            Haltestelle  Komponente\n",
       "0    BerlinHauptbahnhof           2\n",
       "1      BrandenburgerTor           2\n",
       "2             Bundestag           2\n",
       "3     TheodorHeussPlatz           0\n",
       "4        Alexanderplatz           0\n",
       "..                  ...         ...\n",
       "168    WilmersdorferStr           0\n",
       "169     Wittenbergplatz           0\n",
       "170         Wutzkyallee           0\n",
       "171           Zitadelle           0\n",
       "172       ZwickauerDamm           0\n",
       "\n",
       "[173 rows x 2 columns]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Find maximal sets of connected station nodes in a directed graph\n",
    "neo4j = \"\"\"\n",
    "CALL gds.alpha.scc.stream('g')\n",
    "YIELD nodeId, componentId\n",
    "RETURN gds.util.asNode(nodeId).bez AS Haltestelle, componentId AS Komponente\n",
    "ORDER BY Komponente DESC\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            result = session.run(neo4j)\n",
    "            a4_df = pd.DataFrame(result.data())\n",
    "            \n",
    "a4_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 5: Shortest paths between two stations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>HerkunftHaltestelle</th>\n",
       "      <th>ZielHaltestelle</th>\n",
       "      <th>GesamtLaenge</th>\n",
       "      <th>Verlauf</th>\n",
       "      <th>KumulierteLanenge</th>\n",
       "      <th>Pfade</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Tierpark</td>\n",
       "      <td>KochStr</td>\n",
       "      <td>11437.0</td>\n",
       "      <td>[Tierpark, Friedrichsfelde, Lichtenberg, Magda...</td>\n",
       "      <td>[0.0, 1143.0, 2338.0, 2956.0, 3928.0, 4614.0, ...</td>\n",
       "      <td>[{'hid': 10308, 'lng': 13.523626, 'bez': 'Tier...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   index HerkunftHaltestelle ZielHaltestelle  GesamtLaenge  \\\n",
       "0      0            Tierpark         KochStr       11437.0   \n",
       "\n",
       "                                             Verlauf  \\\n",
       "0  [Tierpark, Friedrichsfelde, Lichtenberg, Magda...   \n",
       "\n",
       "                                   KumulierteLanenge  \\\n",
       "0  [0.0, 1143.0, 2338.0, 2956.0, 3928.0, 4614.0, ...   \n",
       "\n",
       "                                               Pfade  \n",
       "0  [{'hid': 10308, 'lng': 13.523626, 'bez': 'Tier...  "
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Find shortest paths, for example, between Tierpark and KochStr\n",
    "neo4j = \"\"\"\n",
    "MATCH (h1:Haltestelle {bez: 'Tierpark'}), (h2:Haltestelle {bez: 'KochStr'})\n",
    "CALL gds.shortestPath.dijkstra.stream('g', {\n",
    "    sourceNode: h1,\n",
    "    targetNode: h2,\n",
    "    relationshipWeightProperty: 'l'\n",
    "})\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs, path\n",
    "RETURN\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).bez AS HerkunftHaltestelle,\n",
    "    gds.util.asNode(targetNode).bez AS ZielHaltestelle,\n",
    "    totalCost as GesamtLaenge,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).bez] AS Verlauf,\n",
    "    costs as KumulierteLanenge,\n",
    "    nodes(path) as Pfade\n",
    "ORDER BY index\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            result = session.run(neo4j)\n",
    "            a5_df = pd.DataFrame(result.data())\n",
    "            \n",
    "a5_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 6: Compute clossness centrality of each station"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>HerkunftHaltestelle</th>\n",
       "      <th>Summe_der_Länge</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bundestag</td>\n",
       "      <td>1424.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>BerlinHauptbahnhof</td>\n",
       "      <td>2118.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>BrandenburgerTor</td>\n",
       "      <td>2154.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Gleisdreieck</td>\n",
       "      <td>1216408.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>HalleschesTor</td>\n",
       "      <td>1220905.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Kienberg</td>\n",
       "      <td>3514858.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CottbusserPlatz</td>\n",
       "      <td>3635710.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hellersdorf</td>\n",
       "      <td>3741162.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>LouisLewinStr</td>\n",
       "      <td>3908656.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hönow</td>\n",
       "      <td>4078840.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>173 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   HerkunftHaltestelle  Summe_der_Länge\n",
       "0            Bundestag           1424.0\n",
       "0   BerlinHauptbahnhof           2118.0\n",
       "0     BrandenburgerTor           2154.0\n",
       "0         Gleisdreieck        1216408.0\n",
       "0        HalleschesTor        1220905.0\n",
       "..                 ...              ...\n",
       "0             Kienberg        3514858.0\n",
       "0      CottbusserPlatz        3635710.0\n",
       "0          Hellersdorf        3741162.0\n",
       "0        LouisLewinStr        3908656.0\n",
       "0                Hönow        4078840.0\n",
       "\n",
       "[173 rows x 2 columns]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Calculate closeness centrality in the network in terms of the length of the segments using Dijkstra single-source shortest path\n",
    "# For each stop, calculate the sum of the lengths of the shortest paths to all other stops\n",
    "neo4j=\"\"\"\n",
    "MATCH (source:Haltestelle {bez:$bez})\n",
    "CALL gds.allShortestPaths.dijkstra.stream('g', {\n",
    "    sourceNode: source,\n",
    "    relationshipWeightProperty: 'l'\n",
    "})\n",
    "YIELD index, sourceNode, targetNode, totalCost, nodeIds, costs\n",
    "WITH\n",
    "    index,\n",
    "    gds.util.asNode(sourceNode).bez AS HerkunftHaltestelle,\n",
    "    gds.util.asNode(targetNode).bez AS ZielHaltestelle,\n",
    "    totalCost as GesamtLaenge,\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).bez] AS nodeNames,\n",
    "    costs as KumulierteLaenge\n",
    "return HerkunftHaltestelle, sum(GesamtLaenge) as Summe_der_Länge\n",
    "\"\"\"\n",
    "\n",
    "a6_df = pd.DataFrame()\n",
    "\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        for r in haltestellen_df.itertuples(index=False):\n",
    "            result=session.run(neo4j, bez=r.bez)\n",
    "            df6 = pd.DataFrame(result.data())\n",
    "            a6_df = pd.concat([a6_df, df6], axis=0)\n",
    "\n",
    "a6_df = a6_df.sort_values(by=['Summe_der_Länge'], ascending=True)\n",
    "a6_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Haltestelle</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bundestag</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>BerlinHauptbahnhof</td>\n",
       "      <td>1.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>BrandenburgerTor</td>\n",
       "      <td>1.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>HalleschesTor</td>\n",
       "      <td>9.727811</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Möckernbrücke</td>\n",
       "      <td>9.769231</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>168</th>\n",
       "      <td>Kienberg</td>\n",
       "      <td>24.313609</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>169</th>\n",
       "      <td>CottbusserPlatz</td>\n",
       "      <td>25.272189</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>170</th>\n",
       "      <td>Hellersdorf</td>\n",
       "      <td>26.242604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>171</th>\n",
       "      <td>LouisLewinStr</td>\n",
       "      <td>27.224852</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>172</th>\n",
       "      <td>Hönow</td>\n",
       "      <td>28.218935</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>173 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            Haltestelle      Score\n",
       "0             Bundestag   1.000000\n",
       "1    BerlinHauptbahnhof   1.500000\n",
       "2      BrandenburgerTor   1.500000\n",
       "3         HalleschesTor   9.727811\n",
       "4         Möckernbrücke   9.769231\n",
       "..                  ...        ...\n",
       "168            Kienberg  24.313609\n",
       "169     CottbusserPlatz  25.272189\n",
       "170         Hellersdorf  26.242604\n",
       "171       LouisLewinStr  27.224852\n",
       "172               Hönow  28.218935\n",
       "\n",
       "[173 rows x 2 columns]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Calculate standard closeness centrality for stations nodes (closeness centrality score)\n",
    "neo4j = \"\"\"\n",
    "CALL gds.beta.closeness.stream('g')\n",
    "YIELD nodeId, score\n",
    "WITH gds.util.asNode(nodeId).bez AS Haltestelle, (1/score) AS Score\n",
    "RETURN Haltestelle, Score\n",
    "ORDER BY Score ASC\n",
    "\"\"\"\n",
    "\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            result = session.run(neo4j)\n",
    "            a6_sd_df = pd.DataFrame(result.data())\n",
    "            \n",
    "a6_sd_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 7: Compute betweeness centrality of each station"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeNames</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[TheodorHeussPlatz]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[TheodorHeussPlatz, Kaiserdamm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[TheodorHeussPlatz, NeuWestend]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[TheodorHeussPlatz, Kaiserdamm, SophieCharlott...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[TheodorHeussPlatz, NeuWestend, OlympiaStadion]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>165</th>\n",
       "      <td>[ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>166</th>\n",
       "      <td>[ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>167</th>\n",
       "      <td>[ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>168</th>\n",
       "      <td>[ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>169</th>\n",
       "      <td>[ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>28909 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             nodeNames\n",
       "0                                  [TheodorHeussPlatz]\n",
       "1                      [TheodorHeussPlatz, Kaiserdamm]\n",
       "2                      [TheodorHeussPlatz, NeuWestend]\n",
       "3    [TheodorHeussPlatz, Kaiserdamm, SophieCharlott...\n",
       "4      [TheodorHeussPlatz, NeuWestend, OlympiaStadion]\n",
       "..                                                 ...\n",
       "165  [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "166  [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "167  [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "168  [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "169  [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "\n",
       "[28909 rows x 1 columns]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Calculate betweeness centrality in the network in terms of the length of the segments using Dijkstra single-source shortest path\n",
    "# For each stop, calculate the number of shortest paths passing through it\n",
    "neo4j = \"\"\"\n",
    "MATCH (h:Haltestelle {bez: $bez})\n",
    "CALL gds.allShortestPaths.dijkstra.stream('g', {\n",
    "    sourceNode: h\n",
    "})\n",
    "YIELD index, sourceNode, targetNode, nodeIds\n",
    "return\n",
    "    [nodeId IN nodeIds | gds.util.asNode(nodeId).bez] AS nodeNames\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "a7_df = pd.DataFrame()\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "        for r in haltestellen_df.itertuples(index=False):\n",
    "            result=session.run(neo4j, bez=r.bez)\n",
    "            df7 = pd.DataFrame(result.data())\n",
    "            a7_df = pd.concat([a7_df, df7], axis=0)\n",
    "\n",
    "a7_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0                                    [TheodorHeussPlatz]\n",
       "1                        [TheodorHeussPlatz, Kaiserdamm]\n",
       "2                        [TheodorHeussPlatz, NeuWestend]\n",
       "3      [TheodorHeussPlatz, Kaiserdamm, SophieCharlott...\n",
       "4        [TheodorHeussPlatz, NeuWestend, OlympiaStadion]\n",
       "                             ...                        \n",
       "165    [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "166    [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "167    [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "168    [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "169    [ZwickauerDamm, Wutzkyallee, Lipschitzallee, J...\n",
       "Name: nodeNames, Length: 28909, dtype: object"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Get list of name of nodes \n",
    "list_nodes = a7_df['nodeNames']\n",
    "list_nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0                                                     []\n",
       "1                                                     []\n",
       "2                                                     []\n",
       "3                                           [Kaiserdamm]\n",
       "4                                           [NeuWestend]\n",
       "                             ...                        \n",
       "165    [Wutzkyallee, Lipschitzallee, JohannisthalerCh...\n",
       "166    [Wutzkyallee, Lipschitzallee, JohannisthalerCh...\n",
       "167    [Wutzkyallee, Lipschitzallee, JohannisthalerCh...\n",
       "168    [Wutzkyallee, Lipschitzallee, JohannisthalerCh...\n",
       "169    [Wutzkyallee, Lipschitzallee, JohannisthalerCh...\n",
       "Name: nodeNames, Length: 28909, dtype: object"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Remove the first element (sourceNode) and last element (targetNode) of the list if the list is not empty, because the shortes path does not include source node and target node\n",
    "for n in list_nodes:\n",
    "    if len(n) != 0:\n",
    "        n.remove(n[0])\n",
    "for n in list_nodes:\n",
    "    if len(n) != 0:\n",
    "        i = len(n)-1\n",
    "        n.remove(n[i])\n",
    "list_nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Stations</th>\n",
       "      <th>Number of paths</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TheodorHeussPlatz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Alexanderplatz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>BerlinHauptbahnhof</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>BrandenburgerTor</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bundesplatz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>168</th>\n",
       "      <td>WilmersdorferStr</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>169</th>\n",
       "      <td>Wittenbergplatz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>170</th>\n",
       "      <td>Wutzkyallee</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>171</th>\n",
       "      <td>Zitadelle</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>172</th>\n",
       "      <td>ZwickauerDamm</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>173 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               Stations  Number of paths\n",
       "0     TheodorHeussPlatz                0\n",
       "1        Alexanderplatz                0\n",
       "2    BerlinHauptbahnhof                0\n",
       "3      BrandenburgerTor                0\n",
       "4           Bundesplatz                0\n",
       "..                  ...              ...\n",
       "168    WilmersdorferStr                0\n",
       "169     Wittenbergplatz                0\n",
       "170         Wutzkyallee                0\n",
       "171           Zitadelle                0\n",
       "172       ZwickauerDamm                0\n",
       "\n",
       "[173 rows x 2 columns]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a new dataframe including list of stations and later storing the number of paths\n",
    "paths_df = pd.DataFrame(columns=['Stations','Number of paths'])\n",
    "paths_df['Stations'] = haltestellen_df['bez']\n",
    "paths_df['Number of paths'] = paths_df['Number of paths'].fillna(0)\n",
    "paths_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Stations</th>\n",
       "      <th>Number of paths</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>109</th>\n",
       "      <td>Möckernbrücke</td>\n",
       "      <td>9247</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Alexanderplatz</td>\n",
       "      <td>9041</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>ZoologischerGarten</td>\n",
       "      <td>8213</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>KottbusserTor</td>\n",
       "      <td>8084</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>HalleschesTor</td>\n",
       "      <td>8058</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>Hönow</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>RathausSteglitz</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>RathausSpandau</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>138</th>\n",
       "      <td>Rudow</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>159</th>\n",
       "      <td>UhlandStr</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>173 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               Stations  Number of paths\n",
       "109       Möckernbrücke             9247\n",
       "1        Alexanderplatz             9041\n",
       "28   ZoologischerGarten             8213\n",
       "92        KottbusserTor             8084\n",
       "71        HalleschesTor             8058\n",
       "..                  ...              ...\n",
       "80                Hönow                0\n",
       "19      RathausSteglitz                0\n",
       "18       RathausSpandau                0\n",
       "138               Rudow                0\n",
       "159           UhlandStr                0\n",
       "\n",
       "[173 rows x 2 columns]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Count shortest paths going through each station\n",
    "for nodes in list_nodes:\n",
    "    for node in nodes:\n",
    "        index = paths_df.index[paths_df['Stations']== node].tolist()[0]\n",
    "        paths_df.at[index,'Number of paths'] +=1\n",
    "\n",
    "paths_df=paths_df.sort_values(by=['Number of paths'], ascending=False)\n",
    "paths_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Möckernbrücke</td>\n",
       "      <td>9396.100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Alexanderplatz</td>\n",
       "      <td>9032.100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ZoologischerGarten</td>\n",
       "      <td>8263.833333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>HalleschesTor</td>\n",
       "      <td>8154.100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>KottbusserTor</td>\n",
       "      <td>8023.866667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>168</th>\n",
       "      <td>Hönow</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>169</th>\n",
       "      <td>KrummeLanke</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>170</th>\n",
       "      <td>Rudow</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>171</th>\n",
       "      <td>Ruhleben</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>172</th>\n",
       "      <td>UhlandStr</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>173 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                   name        score\n",
       "0         Möckernbrücke  9396.100000\n",
       "1        Alexanderplatz  9032.100000\n",
       "2    ZoologischerGarten  8263.833333\n",
       "3         HalleschesTor  8154.100000\n",
       "4         KottbusserTor  8023.866667\n",
       "..                  ...          ...\n",
       "168               Hönow     0.000000\n",
       "169         KrummeLanke     0.000000\n",
       "170               Rudow     0.000000\n",
       "171            Ruhleben     0.000000\n",
       "172           UhlandStr     0.000000\n",
       "\n",
       "[173 rows x 2 columns]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Calculate standard betweeness centrality (betweeness centrality score)\n",
    "neo4j = \"\"\"\n",
    "CALL gds.betweenness.stream('g')\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).bez AS name, score\n",
    "ORDER BY score DESC\n",
    "\"\"\"\n",
    "\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            result = session.run(neo4j)\n",
    "            a7_sd_df = pd.DataFrame(result.data())\n",
    "            \n",
    "a7_sd_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 8: Find path between two stations (transit station if necessary) with Python"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Linie</th>\n",
       "      <th>Verlauf</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>U1</td>\n",
       "      <td>[WarschauerStr, SchlesischesTor, GörlitzerBahn...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>U2</td>\n",
       "      <td>[Pankow, VinetaStr, SchönhauserAllee, Eberswal...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>U3</td>\n",
       "      <td>[WarschauerStr, SchlesischesTor, GörlitzerBahn...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>U4</td>\n",
       "      <td>[InnsbruckerPlatz, RathausSchöneberg, Bayerisc...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>U5</td>\n",
       "      <td>[Alexanderplatz, SchillingStr, StrausbergerPla...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>U55</td>\n",
       "      <td>[BerlinHauptbahnhof, Bundestag, BrandenburgerTor]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>U6</td>\n",
       "      <td>[AltMariendorf, Westphalweg, UllsteinStr, Kais...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>U7</td>\n",
       "      <td>[Rudow, ZwickauerDamm, Wutzkyallee, Lipschitza...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>U8</td>\n",
       "      <td>[HermannStr, LeineStr, BoddinStr, Hermannplatz...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>U9</td>\n",
       "      <td>[RathausSteglitz, SchloßStr, WaltherSchreiberP...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Linie                                            Verlauf\n",
       "0    U1  [WarschauerStr, SchlesischesTor, GörlitzerBahn...\n",
       "1    U2  [Pankow, VinetaStr, SchönhauserAllee, Eberswal...\n",
       "2    U3  [WarschauerStr, SchlesischesTor, GörlitzerBahn...\n",
       "3    U4  [InnsbruckerPlatz, RathausSchöneberg, Bayerisc...\n",
       "4    U5  [Alexanderplatz, SchillingStr, StrausbergerPla...\n",
       "5   U55  [BerlinHauptbahnhof, Bundestag, BrandenburgerTor]\n",
       "6    U6  [AltMariendorf, Westphalweg, UllsteinStr, Kais...\n",
       "7    U7  [Rudow, ZwickauerDamm, Wutzkyallee, Lipschitza...\n",
       "8    U8  [HermannStr, LeineStr, BoddinStr, Hermannplatz...\n",
       "9    U9  [RathausSteglitz, SchloßStr, WaltherSchreiberP..."
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query routes of each line\n",
    "neo4j = \"\"\"\n",
    "match (h:Haltestelle), (a:Abschnitt), (u:Unterlinie), (l:Linie)\n",
    "where h.hid=a.hid_a and a.ulid=u.ulid and u.lid=l.lid\n",
    "with l.bez as Linie, collect(distinct h.bez) as Verlauf\n",
    "return Linie, Verlauf\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(c.neo4j_host, auth=(c.neo4j_userid, c.neo4j_password)) as driver:\n",
    "    with driver.session() as session:\n",
    "            result = session.run(neo4j)\n",
    "            routes_df = pd.DataFrame(result.data())\n",
    "            \n",
    "routes_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'U1': ['WarschauerStr',\n",
       "  'SchlesischesTor',\n",
       "  'GörlitzerBahnhof',\n",
       "  'KottbusserTor',\n",
       "  'PrinzenStr',\n",
       "  'HalleschesTor',\n",
       "  'Möckernbrücke',\n",
       "  'Gleisdreieck',\n",
       "  'KurfürstenStr',\n",
       "  'Nollendorfplatz',\n",
       "  'Wittenbergplatz',\n",
       "  'Kurfürstendamm',\n",
       "  'UhlandStr'],\n",
       " 'U2': ['Pankow',\n",
       "  'VinetaStr',\n",
       "  'SchönhauserAllee',\n",
       "  'EberswalderStr',\n",
       "  'Senefelderplatz',\n",
       "  'RosaLuxemburgPlatz',\n",
       "  'Alexanderplatz',\n",
       "  'KlosterStr',\n",
       "  'MärkischesMuseum',\n",
       "  'Spittelmarkt',\n",
       "  'Hausvogteiplatz',\n",
       "  'Stadtmitte',\n",
       "  'MohrenStr',\n",
       "  'PotsdamerPlatz',\n",
       "  'MendelssohnBartholdyPark',\n",
       "  'Gleisdreieck',\n",
       "  'BülowStr',\n",
       "  'Nollendorfplatz',\n",
       "  'Wittenbergplatz',\n",
       "  'ZoologischerGarten',\n",
       "  'ErnstReuterPlatz',\n",
       "  'DeutscheOper',\n",
       "  'BismarckStr',\n",
       "  'SophieCharlottePlatz',\n",
       "  'Kaiserdamm',\n",
       "  'TheodorHeussPlatz',\n",
       "  'NeuWestend',\n",
       "  'OlympiaStadion',\n",
       "  'Ruhleben'],\n",
       " 'U3': ['WarschauerStr',\n",
       "  'SchlesischesTor',\n",
       "  'GörlitzerBahnhof',\n",
       "  'KottbusserTor',\n",
       "  'PrinzenStr',\n",
       "  'HalleschesTor',\n",
       "  'Möckernbrücke',\n",
       "  'Gleisdreieck',\n",
       "  'KurfürstenStr',\n",
       "  'Nollendorfplatz',\n",
       "  'Wittenbergplatz',\n",
       "  'AugsburgerStr',\n",
       "  'SpichernStr',\n",
       "  'Hohenzollernplatz',\n",
       "  'FehrbellinerPlatz',\n",
       "  'HeidelbergerPlatz',\n",
       "  'RüdesheimerPlatz',\n",
       "  'Breitenbachplatz',\n",
       "  'Podbielskiallee',\n",
       "  'DahlemDorf',\n",
       "  'FreieUniversität',\n",
       "  'OskarHeleneHeim',\n",
       "  'OnkelTomsHütte',\n",
       "  'KrummeLanke'],\n",
       " 'U4': ['InnsbruckerPlatz',\n",
       "  'RathausSchöneberg',\n",
       "  'BayerischerPlatz',\n",
       "  'ViktoriaLuisePlatz',\n",
       "  'Nollendorfplatz'],\n",
       " 'U5': ['Alexanderplatz',\n",
       "  'SchillingStr',\n",
       "  'StrausbergerPlatz',\n",
       "  'Weberwiese',\n",
       "  'FrankfurterTor',\n",
       "  'SamariterStr',\n",
       "  'FrankfurterAllee',\n",
       "  'MagdalenenStr',\n",
       "  'Lichtenberg',\n",
       "  'Friedrichsfelde',\n",
       "  'Tierpark',\n",
       "  'BiesdorfSüd',\n",
       "  'ElsterwerdaerPlatz',\n",
       "  'Wuhletal',\n",
       "  'KaulsdorfNord',\n",
       "  'Kienberg',\n",
       "  'CottbusserPlatz',\n",
       "  'Hellersdorf',\n",
       "  'LouisLewinStr',\n",
       "  'Hönow'],\n",
       " 'U55': ['BerlinHauptbahnhof', 'Bundestag', 'BrandenburgerTor'],\n",
       " 'U6': ['AltMariendorf',\n",
       "  'Westphalweg',\n",
       "  'UllsteinStr',\n",
       "  'KaiserinAugustaStr',\n",
       "  'AltTempelhof',\n",
       "  'Tempelhof',\n",
       "  'ParadeStr',\n",
       "  'PlatzDerLuftbrücke',\n",
       "  'Mehringdamm',\n",
       "  'HalleschesTor',\n",
       "  'KochStr',\n",
       "  'Stadtmitte',\n",
       "  'FranzösischeStr',\n",
       "  'FriedrichStr',\n",
       "  'OranienburgerTor',\n",
       "  'Naturkundemuseum',\n",
       "  'SchwartzkopffStr',\n",
       "  'ReinickendorferStr',\n",
       "  'Wedding',\n",
       "  'Leopoldplatz',\n",
       "  'SeeStr',\n",
       "  'Rehberge',\n",
       "  'AfrikanischeStr',\n",
       "  'KurtSchumacherPlatz',\n",
       "  'ScharnweberStr',\n",
       "  'OtisStr',\n",
       "  'HolzhauserStr',\n",
       "  'Borsigwerke',\n",
       "  'AltTegel'],\n",
       " 'U7': ['Rudow',\n",
       "  'ZwickauerDamm',\n",
       "  'Wutzkyallee',\n",
       "  'Lipschitzallee',\n",
       "  'JohannisthalerChaussee',\n",
       "  'BritzSüd',\n",
       "  'ParchimerAllee',\n",
       "  'Blaschkoallee',\n",
       "  'Grenzallee',\n",
       "  'Neukölln',\n",
       "  'KarlMarxStr',\n",
       "  'RathausNeukölln',\n",
       "  'Hermannplatz',\n",
       "  'Südstern',\n",
       "  'Gneisenaustr',\n",
       "  'Mehringdamm',\n",
       "  'Möckernbrücke',\n",
       "  'YorckStr',\n",
       "  'Kleistpark',\n",
       "  'EisenacherStr',\n",
       "  'BayerischerPlatz',\n",
       "  'BerlinerStr',\n",
       "  'BlisseStr',\n",
       "  'FehrbellinerPlatz',\n",
       "  'KonstanzerStr',\n",
       "  'Adenauerplatz',\n",
       "  'WilmersdorferStr',\n",
       "  'BismarckStr',\n",
       "  'RichardWagnerPlatz',\n",
       "  'Mierendorffplatz',\n",
       "  'Jungfernheide',\n",
       "  'JakobKaiserPlatz',\n",
       "  'Halemweg',\n",
       "  'Siemensdamm',\n",
       "  'Rohrdamm',\n",
       "  'PaulsternStr',\n",
       "  'Haselhorst',\n",
       "  'Zitadelle',\n",
       "  'AltstadtSpandau',\n",
       "  'RathausSpandau'],\n",
       " 'U8': ['HermannStr',\n",
       "  'LeineStr',\n",
       "  'BoddinStr',\n",
       "  'Hermannplatz',\n",
       "  'SchönleinStr',\n",
       "  'KottbusserTor',\n",
       "  'Moritzplatz',\n",
       "  'HeinrichHeineStr',\n",
       "  'Jannowitzbrücke',\n",
       "  'Alexanderplatz',\n",
       "  'WeinmeisterStr',\n",
       "  'RosenthalerPlatz',\n",
       "  'BernauerStr',\n",
       "  'VoltaStr',\n",
       "  'Gesundbrunnen',\n",
       "  'PankStr',\n",
       "  'OsloerStr',\n",
       "  'FranzNeumannPlatz',\n",
       "  'ResidenzStr',\n",
       "  'ParacelsusBad',\n",
       "  'LindauerAllee',\n",
       "  'KarlBonhoefferNervenklinik',\n",
       "  'RathausReinickendorf',\n",
       "  'Wittenau'],\n",
       " 'U9': ['RathausSteglitz',\n",
       "  'SchloßStr',\n",
       "  'WaltherSchreiberPlatz',\n",
       "  'FriedrichWilhelmPlatz',\n",
       "  'Bundesplatz',\n",
       "  'BerlinerStr',\n",
       "  'GüntzelStr',\n",
       "  'SpichernStr',\n",
       "  'Kurfürstendamm',\n",
       "  'ZoologischerGarten',\n",
       "  'Hansaplatz',\n",
       "  'Turmstr',\n",
       "  'BirkenStr',\n",
       "  'Westhafen',\n",
       "  'AmrumerStr',\n",
       "  'Leopoldplatz',\n",
       "  'NauenerPlatz',\n",
       "  'OsloerStr']}"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "routes = {}\n",
    "routes = dict(zip(routes_df['Linie'], routes_df['Verlauf']))\n",
    "routes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [],
   "source": [
    "class TrainOrder:\n",
    "    def __init__(self, train, order, usedTrains):\n",
    "        self.train = train\n",
    "        self.order = order\n",
    "        self.usedTrains = usedTrains\n",
    "\n",
    "# Get the trains go through each stop\n",
    "def buildStopToTrainsMap(routes):\n",
    "    stopToTrains = {}\n",
    "    for train in routes.keys():\n",
    "        for stop in routes[train]:\n",
    "            if stop in stopToTrains:\n",
    "                stopToTrains[stop].append(train)\n",
    "            else:\n",
    "                stopToTrains[stop] = [train]\n",
    "    return stopToTrains\n",
    "\n",
    "# Get the trains connect to train\n",
    "def buildTrainToTrainsMap(stopToTrainsMap, routes):\n",
    "    trainToConnectingTrainsMap = {}\n",
    "    for train in routes.keys():\n",
    "        connectingTrainsSet = []\n",
    "        for stop in routes[train]:\n",
    "            connectingTrainsSet.extend(stopToTrainsMap[stop])\n",
    "        trainToConnectingTrainsMap[train] = list(set(connectingTrainsSet))\n",
    "    return trainToConnectingTrainsMap\n",
    "\n",
    "# Get the trains connect to train\n",
    "def findUsedTrainsUsingBFS(startTrains, endTrains, trainToTrainsMap):\n",
    "    if startTrains == None or endTrains == None:\n",
    "        return []\n",
    "    visitedTrainsSet = []  # List of visited train\n",
    "    trainOrderQueue = []  # List of train order\n",
    "\n",
    "    for startTrain in startTrains:\n",
    "        trainOrderQueue.append(TrainOrder(startTrain, 1, [startTrain]))\n",
    "\n",
    "    while trainOrderQueue:\n",
    "        trainOrder = trainOrderQueue.pop(0)\n",
    "        visitedTrainsSet.append(trainOrder.train)\n",
    "\n",
    "        if trainOrder.train in endTrains:\n",
    "            return trainOrder.usedTrains\n",
    "\n",
    "        connectingTrains = trainToTrainsMap[trainOrder.train]\n",
    "        for connectingTrain in connectingTrains:\n",
    "            if not connectingTrain in visitedTrainsSet:\n",
    "                usedTrains = trainOrder.usedTrains.copy() + [connectingTrain]\n",
    "                trainOrderQueue.append(TrainOrder(\n",
    "                    connectingTrain, trainOrder.order + 1, usedTrains))\n",
    "    return []\n",
    "\n",
    "\n",
    "def main():\n",
    "    start = \"UhlandStr\"\n",
    "    end = \"Hönow\"\n",
    "    stopToTrainsMap = buildStopToTrainsMap(routes)\n",
    "    trainToTrainsMap = buildTrainToTrainsMap(stopToTrainsMap, routes)\n",
    "    startTrains = stopToTrainsMap[start]\n",
    "    endTrains = stopToTrainsMap[end]\n",
    "    visitedTrains = findUsedTrainsUsingBFS(\n",
    "        startTrains, endTrains, trainToTrainsMap)\n",
    "    visitedStop = []\n",
    "\n",
    "    for key, train in enumerate(visitedTrains):\n",
    "        if key + 1 < len(visitedTrains):\n",
    "            stop = [value for value in routes[visitedTrains[key]]\n",
    "                    if value in routes[visitedTrains[key + 1]]]\n",
    "            visitedStop.append(stop[0])\n",
    "    print(\"Visited trains: \", visitedTrains)\n",
    "    print(\"Visited stops/ Stops to transit: \", visitedStop)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Visited trains:  ['U1', 'U2', 'U5']\n",
      "Visited stops/ Stops to transit:  ['Gleisdreieck', 'Alexanderplatz']\n"
     ]
    }
   ],
   "source": [
    "main()"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "a4ed7d244ee1f41d07940162cfb3a11255e37fb7f953a2db89897b240d536fb5"
  },
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
